app/controllers/items_controller.rb

INSERT INTO "items" ("Price", "created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["Price", 55], ["created_at", Wed, 18 Feb 2015 00:03:00 UTC +00:00], ["name", "test item"], ["updated_at", Wed, 18 Feb 2015 00:03:00 UTC +00:00], ["user_id", 1]]
---
  def create
    @item.user_id = current_user.id
    @item.save